In [525]:
import pandas as pd
import numpy as np

In [526]:
pd.__version__

'2.3.3'

In [527]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [528]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [529]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [530]:
obj2=pd.Series([4,7,-5,3], index=['a', 'b', 'c', 'd'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [531]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [532]:
obj2['c']

np.int64(-5)

In [533]:
obj2["b"]=45

In [534]:
obj2

a     4
b    45
c    -5
d     3
dtype: int64

In [535]:
obj2[["b", "c", "d"]]

b    45
c    -5
d     3
dtype: int64

In [536]:
np.exp(obj2)

a    5.459815e+01
b    3.493427e+19
c    6.737947e-03
d    2.008554e+01
dtype: float64

In [537]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3=pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [538]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [539]:
states=["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [540]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [541]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [542]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [543]:
obj4 + obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [544]:
obj4.name = "population"
obj4.index.name="state"

In [545]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [546]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [547]:
obj.index=["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# Data Frame

In [548]:
data={"State":["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
      "Year":[2000, 2001, 2002, 2001, 2002, 2003],
      "Pop":[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data)
frame

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [549]:
frame.head()

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [550]:
frame.tail()

    State  Year  Pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [551]:
pd.DataFrame(data, columns=["Year", "State", "Pop"])

   Year   State  Pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [552]:
frame2=pd.DataFrame(data, columns=["Year", "State", "Pop", "Debt"])
frame2

   Year   State  Pop Debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [553]:
frame2.columns

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')

In [554]:
frame2.Year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: Year, dtype: int64

In [555]:
frame2.State

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: State, dtype: object

In [556]:
frame2.loc[1]

Year     2001
State    Ohio
Pop       1.7
Debt      NaN
Name: 1, dtype: object

In [557]:
frame2.iloc[2]

Year     2002
State    Ohio
Pop       3.6
Debt      NaN
Name: 2, dtype: object

In [558]:
frame2["Debt"] = 16.5
frame2

   Year   State  Pop  Debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [559]:
frame2["eastern"] = frame2["State"] == "Ohio"
frame2

   Year   State  Pop  Debt  eastern
0  2000    Ohio  1.5  16.5     True
1  2001    Ohio  1.7  16.5     True
2  2002    Ohio  3.6  16.5     True
3  2001  Nevada  2.4  16.5    False
4  2002  Nevada  2.9  16.5    False
5  2003  Nevada  3.2  16.5    False

In [560]:
del frame2["eastern"]
frame2.columns

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')

In [561]:
population = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
              "Nevada": {2001: 2.4, 2002: 2.9}}
frame3 = pd.DataFrame(population)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [562]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [563]:
pd.DataFrame(population, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [564]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [565]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [566]:
pd.DataFrame([
    {"A": 1, "B": 2},
    {"A": 3, "C": 4}
])

   A    B    C
0  1  2.0  NaN
1  3  NaN  4.0

In [567]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [568]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
index=obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [569]:
# index[1] = "d" # TypeError("Index does not support mutable operations")

In [570]:
levels=pd.Index(np.arange(1,4))
levels

Index([1, 2, 3], dtype='int64')

In [571]:
obj2=pd.Series([1.5, -2.5, 0], index=levels)
obj2

1    1.5
2   -2.5
3    0.0
dtype: float64

In [572]:
obj2.index is levels

True